app/controllers/students_controller.rb

  def create
    @student = Student.new(post_params)
    @student.save
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2017-06-12 21:57:45.241655"], ["updated_at", "2017-06-12 21:57:45.241655"]]

  def update
    @student = Student.find(params[:id])
    @student.update(post_params)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2017-06-12 22:26:05.516063"], ["id", 1]]